TagEnd/FSC-FS-Net_STM32H743VITx/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_BUSY_Pin GPIO_PIN_5
#define ADC_BUSY_GPIO_Port GPIOA
#define ADC_BUSY_EXTI_IRQn EXTI9_5_IRQn
#define LCD_CS_Pin GPIO_PIN_14
#define LCD_CS_GPIO_Port GPIOB
#define KEY_Pin GPIO_PIN_11
#define KEY_GPIO_Port GPIOD
#define ESP_SPI_HANDSHAKE_Pin GPIO_PIN_12
#define ESP_SPI_HANDSHAKE_GPIO_Port GPIOD
#define ESP_SPI_HANDSHAKE_EXTI_IRQn EXTI15_10_IRQn
#define WIFI_CS_Pin GPIO_PIN_13
#define WIFI_CS_GPIO_Port GPIOD
#define LCD_RST_Pin GPIO_PIN_6
#define LCD_RST_GPIO_Port GPIOC
#define LCD_BLK_Pin GPIO_PIN_7
#define LCD_BLK_GPIO_Port GPIOC
#define LCD_DC_Pin GPIO_PIN_11
#define LCD_DC_GPIO_Port GPIOC
#define ADC_RST_Pin GPIO_PIN_12
#define ADC_RST_GPIO_Port GPIOC
#define ADC_STBY_Pin GPIO_PIN_3
#define ADC_STBY_GPIO_Port GPIOD
#define ADC_CS_Pin GPIO_PIN_7
#define ADC_CS_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
